Revit 2027 API
FabricWireType.BendDiameter Property
 Determines the bending diameter of the wire.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BendDiameter { get; set; }
Public Property BendDiameter As Double
	Get
	Set
public:
property double BendDiameter {
	double get ();
	void set (double value);
}
member BendDiameter : float with get, set
Property Value
Double
 The value should be positive.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for bendDiameter is not a number
ArgumentOutOfRangeException |  When setting this property: The bending diameter bendDiameter is negative.
See Also
Reference
FabricWireType Class
Autodesk.Revit.DB.Structure Namespace